Revit 2026 API

# DocumentPrintedEventArgs Methods

---

The DocumentPrintedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFailedViewElementIds | Returns ElementIds of the views that that failed to print (if any). |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPrintedViewElementIds | Returns ElementIds of the views that printed successfully. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DocumentPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace